# Octave

## Dot product
```
octave:1> a = [3;4]
a =

   3
   4

octave:2> b = [5;6]
b =

   5
   6

octave:3> dot(a,b)
ans =  39
```

## Transpose
```
octave:4> a'
ans =

   3   4
```
